# Begin2.
# Дана сторона квадрата a.
# Найти его площадь S = a2.
value1 = 20
square = value1 ** 2
print("Square:",square)